Revit 2027 API
RuledSurface.GetSecondProfilePoint Method
 If a point was used to define the second profile, returns a copy of that point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetSecondProfilePoint()
Public Function GetSecondProfilePoint As XYZ
public:
XYZ^ GetSecondProfilePoint()
member GetSecondProfilePoint : unit -> XYZ
Return Value
XYZ
 The second profile point if it was set.
Exceptions
Exception | Condition
InvalidOperationException |  This surface element does not use a point to define the second profile.
See Also
Reference
RuledSurface Class
Autodesk.Revit.DB Namespace